Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# rag.workspace.debug.stage.repoContextProjection
source: Project code window fit
ar: ملاءمة نافذة كود المشروع
de: Projektcode-Fensteranpassung
es: Ajuste de ventana de código del proyecto
fr: Ajustement de la fenêtre de code du projet
id: Kesesuaian jendela kode proyek
it: Adattamento finestra codice progetto
ja: プロジェクトコードウィンドウ適合
ko: 프로젝트 코드 창 맞춤
nl: Projectcodevenster passend
pl: Dopasowanie okna kodu projektu
pt_br: Ajuste de janela de código do projeto
ru: Подгонка окна кода проекта
tr: Proje kodu pencere uyumu
uk: Відповідність вікна коду проєкту
vi: Khớp cửa sổ mã dự án
zh_hans: 项目代码窗口适配
zh_hant: 專案程式碼視窗適配

# rag.workspace.debug.stage.repoContextRequest
source: Project code request
ar: طلب كود المشروع
de: Projektcode-Anfrage
es: Solicitud de código del proyecto
fr: Requête de code du projet
id: Permintaan kode proyek
it: Richiesta codice progetto
ja: プロジェクトコードリクエスト
ko: 프로젝트 코드 요청
nl: Projectcodeverzoek
pl: Żądanie kodu projektu
pt_br: Requisição de código do projeto
ru: Запрос кода проекта
tr: Proje kodu isteği
uk: Запит коду проєкту
vi: Yêu cầu mã dự án
zh_hans: 项目代码请求
zh_hant: 專案程式碼請求

# rag.workspace.debug.stage.repoContextResponse
source: Project code result
ar: نتيجة كود المشروع
de: Projektcode-Ergebnis
es: Resultado de código del proyecto
fr: Résultat du code du projet
id: Hasil kode proyek
it: Risultato codice progetto
ja: プロジェクトコード結果
ko: 프로젝트 코드 결과
nl: Projectcoderesultaat
pl: Wynik kodu projektu
pt_br: Resultado do código do projeto
ru: Результат кода проекта
tr: Proje kodu sonucu
uk: Результат коду проєкту
vi: Kết quả mã dự án
zh_hans: 项目代码结果
zh_hant: 專案程式碼結果

# rag.workspace.debug.stage.request
source: RAG Request
ar: طلب RAG
de: RAG-Anfrage
es: Solicitud RAG
fr: Requête RAG
id: Permintaan RAG
it: Richiesta RAG
ja: RAG リクエスト
ko: RAG 요청
nl: RAG-verzoek
pl: Żądanie RAG
pt_br: Requisição RAG
ru: Запрос RAG
tr: RAG İsteği
uk: Запит RAG
vi: Yêu cầu RAG
zh_hans: RAG 请求
zh_hant: RAG 請求

# rag.workspace.debug.stage.rerank
source: Rerank
ar: إعادة الترتيب
fr: Reranking
ja: 再ランク
pt_br: Reclassificar
ru: Реранжирование
uk: Реранжування
zh_hans: 重排序
zh_hant: 重排序

# rag.workspace.debug.stage.response
source: LLM Response
ar: استجابة LLM
de: LLM-Antwort
es: Respuesta del LLM
fr: Réponse du LLM
id: Respons LLM
it: Risposta LLM
ja: LLM 応答
ko: LLM 응답
nl: LLM-antwoord
pl: Odpowiedź LLM
pt_br: Resposta do LLM
ru: Ответ LLM
tr: LLM Yanıtı
uk: Відповідь LLM
vi: Phản hồi LLM
zh_hans: LLM 返回
zh_hant: LLM 回應

# rag.workspace.debug.stage.retrieval
source: Retrieval
ar: الاسترجاع
de: Abruf
es: Recuperación
fr: Récupération
id: Pengambilan
it: Recupero
ja: 検索
ko: 검색
nl: Ophalen
pl: Wyszukiwanie
pt_br: Recuperação
ru: Поиск
tr: Alma
uk: Пошук
vi: Truy xuất
zh_hans: 检索结果
zh_hant: 檢索結果

# rag.workspace.debug.stage.structuredAnalytics
source: Structured analytics
ar: تحليلات منظمة
de: Strukturierte Analyse
es: Analítica estructurada
fr: Analyse structurée
id: Analitik terstruktur
it: Analisi strutturata
ja: 構造化分析
ko: 구조화된 분석
nl: Gestructureerde analyse
pl: Analityka strukturalna
pt_br: Análise estruturada
ru: Структурированная аналитика
tr: Yapılandırılmış analitik
uk: Структурована аналітика
vi: Phân tích có cấu trúc
zh_hans: 结构化分析
zh_hant: 結構化分析

# rag.workspace.debug.stage.titlePrompt
source: Title Prompt
ar: موجه العنوان
de: Titel-Eingabeaufforderung
es: Prompt del título
fr: Invite de titre
id: Prompt Judul
it: Prompt del titolo
ja: タイトルプロンプト
ko: 제목 프롬프트
nl: Titelprompt
pl: Prompt tytułu
pt_br: Prompt de título
ru: Заголовок запроса
tr: Başlık İstemi
uk: Запит заголовка
vi: Lời nhắc tiêu đề
zh_hans: 标题生成 Prompt
zh_hant: 標題生成 Prompt

# rag.workspace.debug.stage.titleResponse
source: Title Response
ar: استجابة العنوان
de: Titel-Antwort
es: Respuesta del título
fr: Réponse du titre
id: Respons Judul
it: Risposta del titolo
ja: タイトル応答
ko: 제목 응답
nl: Titelantwoord
pl: Odpowiedź tytułu
pt_br: Resposta de título
ru: Заголовок ответа
tr: Başlık Yanıtı
uk: Відповідь заголовка
vi: Phản hồi tiêu đề
zh_hans: 标题生成返回
zh_hant: 標題生成回應

# rag.workspace.debug.state.cancelled
source: Cancelled
ar: مُلغى
de: Abgebrochen
es: Cancelado
fr: Annulé
id: Dibatalkan
it: Annullato
ja: キャンセル済み
ko: 취소됨
nl: Geannuleerd
pl: Anulowano
pt_br: Cancelado
ru: Отменено
tr: İptal Edildi
uk: Скасовано
vi: Đã hủy
zh_hans: 已取消
zh_hant: 已取消

# rag.workspace.debug.state.completed
source: Completed
ar: مكتمل
de: Abgeschlossen
es: Completado
fr: Terminé
id: Selesai
it: Completato
ja: 完了
ko: 완료됨
nl: Voltooid
pl: Ukończono
pt_br: Concluído
ru: Завершено
tr: Tamamlandı
uk: Завершено
vi: Hoàn thành
zh_hans: 已完成
zh_hant: 已完成

# rag.workspace.debug.state.failed
source: Failed
ar: فشل
de: Fehlgeschlagen
es: Fallido
fr: Échoué
id: Gagal
it: Fallito
ja: 失敗
ko: 실패
nl: Mislukt
pl: Niepowodzenie
pt_br: Falhou
ru: Ошибка
tr: Başarısız
uk: Помилка
vi: Thất bại
zh_hans: 失败
zh_hant: 失敗

# rag.workspace.debug.state.running
source: Running
ar: قيد التشغيل
de: Wird ausgeführt
es: Ejecutando
fr: En cours
id: Berjalan
it: In esecuzione
ja: 実行中
ko: 실행 중
nl: Bezig
pl: Uruchomiono
pt_br: Em execução
ru: Выполняется
tr: Çalışıyor
uk: Виконується
vi: Đang chạy
zh_hans: 进行中
zh_hant: 進行中

# rag.workspace.debug.stepDuration.help
source: Duration of this step (since the previous debug event)
ar: مدة هذه الخطوة (منذ حدث التصحيح السابق)
de: Dauer dieses Schritts (seit dem letzten Debug-Ereignis)
es: Duración de este paso (desde el evento de depuración anterior)
fr: Durée de cette étape (depuis l'événement de débogage précédent)
id: Durasi langkah ini (sejak peristiwa debug sebelumnya)
it: Durata di questo passo (dall'evento di debug precedente)
ja: このステップの所要時間（前回のデバッグイベントからの経過時間）
ko: 이 단계의 지속 시간 (이전 디버그 이벤트 이후)
nl: Duur van deze stap (sinds de vorige debuggebeurtenis)
pl: Czas trwania tego kroku (od poprzedniego zdarzenia debugowania)
pt_br: Duração desta etapa (desde o evento de depuração anterior)
ru: Длительность этого шага (с предыдущего события отладки)
tr: Bu adımın süresi (önceki hata ayıklama olayından bu yana)
uk: Тривалість цього кроку (від попередньої події налагодження)
vi: Thời gian của bước này (kể từ sự kiện gỡ lỗi trước đó)
zh_hans: 本步耗时（相对上一条调试事件）
zh_hant: 此步驟耗時（相對上一條偵錯事件）

# rag.workspace.empty.noKnowledge.banner
source: No repositories in the knowledge base yet.
ar: لا توجد مستودعات في قاعدة المعرفة بعد.
de: Noch keine Repositories in der Wissensdatenbank.
es: Aún no hay repositorios en la base de conocimiento.
fr: Aucun dépôt dans la base de connaissances pour l'instant.
id: Belum ada repositori di basis pengetahuan.
it: Ancora nessun repository nella knowledge base.
ja: ナレッジベースにまだリポジトリがありません。
ko: 아직 지식 베이스에 리포지토리가 없습니다.
nl: Nog geen repositories in de kennisbank.
pl: Brak repozytoriów w bazie wiedzy.
pt_br: Ainda não há repositórios na base de conhecimento.
ru: В базе знаний пока нет репозиториев.
tr: Bilgi tabanında henüz depo yok.
uk: У базі знань ще немає репозиторіїв.
vi: Chưa có kho lưu trữ nào trong cơ sở tri thức.
zh_hans: 知识库里还没有仓库。
zh_hant: 知識庫裡還沒有倉庫。

# rag.workspace.empty.noKnowledge.subtitle
source: Add starred repositories to your knowledge base before asking questions.
ar: أضف مستودعات مميزة بنجمة إلى قاعدة معرفتك قبل طرح الأسئلة.
de: Fügen Sie Ihrer Wissensdatenbank mit Stern markierte Repositories hinzu, bevor Sie Fragen stellen.
es: Agregue repositorios destacados a su base de conocimiento antes de hacer preguntas.
fr: Ajoutez des dépôts avec une étoile à votre base de connaissances avant de poser des questions.
id: Tambahkan repositori yang dibintangi ke basis pengetahuan Anda sebelum mengajukan pertanyaan.
it: Aggiungi repository con stella alla tua knowledge base prima di fare domande.
ja: 質問する前に、スター付きリポジトリをナレッジベースに追加してください。
ko: 질문하기 전에 즐겨찾기한 리포지토리를 지식 베이스에 추가하세요.
nl: Voeg gemarkeerde repositories toe aan je kennisbank voordat je vragen stelt.
pl: Dodaj oznaczone gwiazdką repozytoria do bazy wiedzy przed zadawaniem pytań.
pt_br: Adicione repositórios favoritos à sua base de conhecimento antes de fazer perguntas.
ru: Добавьте отмеченные звёздочкой репозитории в базу знаний, прежде чем задавать вопросы.
tr: Soru sormadan önce yıldızlı depoları bilgi tabanınıza ekleyin.
uk: Додайте позначені зірочкою репозиторії до бази знань, перш ніж ставити запитання.
vi: Thêm các kho lưu trữ đã gắn sao vào cơ sở tri thức trước khi đặt câu hỏi.
zh_hans: 先从 Stars 里挑选项目加入知识库，才能开始提问。
zh_hant: 先從 Stars 裡挑選專案加入知識庫，才能開始提問。

# rag.workspace.empty.noKnowledge.title
source: Knowledge base is empty
ar: قاعدة المعرفة فارغة
de: Wissensdatenbank ist leer
es: La base de conocimiento está vacía
fr: La base de connaissances est vide
id: Basis pengetahuan kosong
it: La knowledge base è vuota
ja: ナレッジベースが空です
ko: 지식 베이스가 비어 있음
nl: Kennisbank is leeg
pl: Baza wiedzy jest pusta
pt_br: A base de conhecimento está vazia
ru: База знаний пуста
tr: Bilgi tabanı boş
uk: База знань порожня
vi: Cơ sở tri thức trống
zh_hans: 知识库还是空的
zh_hant: 知識庫還是空的

# rag.workspace.empty.subtitle
source: Use @ to select one or more knowledge-base repositories, or ask across the whole knowledge base.
ar: استخدم @ لتحديد مستودع واحد أو أكثر من قاعدة المعرفة، أو اسأل عبر قاعدة المعرفة بأكملها.
de: Verwenden Sie @, um ein oder mehrere Repositories der Wissensdatenbank auszuwählen oder fragen Sie die gesamte Wissensdatenbank ab.
es: Use @ para seleccionar uno o más repositorios de la base de conocimiento, o pregunte en toda la base de conocimiento.
fr: Utilisez @ pour sélectionner un ou plusieurs dépôts de la base de connaissances, ou interrogez l'ensemble de la base de connaissances.
id: Gunakan @ untuk memilih satu atau lebih repositori basis pengetahuan, atau bertanya di seluruh basis pengetahuan.
it: Usa @ per selezionare uno o più repository della knowledge base, o chiedi all'intera knowledge base.
ja: @ を使用して 1 つ以上のナレッジベースリポジトリを選択するか、ナレッジベース全体に質問してください。
ko: @를 사용하여 하나 이상의 지식 베이스 리포지토리를 선택하거나 전체 지식 베이스에 질문하세요.
nl: Gebruik @ om een of meer kennisbank-repositories te selecteren, of stel een vraag over de hele kennisbank.
pl: Użyj @, aby wybrać jedno lub więcej repozytoriów bazy wiedzy, lub zadaj pytanie w całej bazie wiedzy.
pt_br: Use @ para selecionar um ou mais repositórios da base de conhecimento ou pergunte em toda a base de conhecimento.
ru: Используйте @ для выбора одного или нескольких репозиториев базы знаний или задайте вопрос по всей базе знаний.
tr: Bir veya daha fazla bilgi tabanı deposu seçmek için @ kullanın veya tüm bilgi tabanına sorun.
uk: Використовуйте @, щоб вибрати один або кілька репозиторіїв бази знань або запитати всю базу знань.
vi: Sử dụng @ để chọn một hoặc nhiều kho lưu trữ trong cơ sở tri thức, hoặc hỏi trên toàn bộ cơ sở tri thức.
zh_hans: 使用 @ 选择一个或多个知识库仓库，或直接面向整个知识库提问。
zh_hant: 使用 @ 選擇一個或多個知識庫倉庫，或直接面向整個知識庫提問。

# rag.workspace.empty.title
source: Ask your knowledge base
ar: اسأل قاعدة معرفتك
de: Fragen Sie Ihre Wissensdatenbank
es: Pregunte a su base de conocimiento
fr: Interrogez votre base de connaissances
id: Tanyakan basis pengetahuan Anda
it: Chiedi alla tua knowledge base
ja: ナレッジベースに質問
ko: 지식 베이스에 질문하기
nl: Stel een vraag aan je kennisbank
pl: Zadaj pytanie swojej bazie wiedzy
pt_br: Pergunte à sua base de conhecimento
ru: Задайте вопрос базе знаний
tr: Bilgi tabanına sorun
uk: Запитайте свою базу знань
vi: Hỏi cơ sở tri thức của bạn
zh_hans: 向知识库提问
zh_hant: 向知識庫提問

# rag.workspace.error.action.checkNetwork
source: Retry after checking network
ar: أعد المحاولة بعد التحقق من الشبكة
de: Nach Überprüfung der Netzwerkverbindung erneut versuchen
es: Reintentar después de verificar la red
fr: Réessayer après avoir vérifié le réseau
id: Coba lagi setelah memeriksa jaringan
it: Riprova dopo aver controllato la rete
ja: ネットワークを確認して再試行
ko: 네트워크 확인 후 재시도
nl: Opnieuw proberen na controle van de netwerkverbinding
pl: Spróbuj ponownie po sprawdzeniu sieci
pt_br: Tentar novamente após verificar a rede
ru: Повторить после проверки сети
tr: Ağı kontrol ettikten sonra yeniden dene
uk: Повторити після перевірки мережі
vi: Thử lại sau khi kiểm tra mạng
zh_hans: 检查网络后重试
zh_hant: 檢查網路後重試

# rag.workspace.error.action.openAISettings
source: Open AI Settings
ar: فتح إعدادات AI
de: KI-Einstellungen öffnen
es: Abrir configuración de IA
fr: Ouvrir les réglages IA
id: Buka Pengaturan AI
it: Apri Impostazioni AI
ja: AI 設定を開く
ko: AI 설정 열기
nl: AI-instellingen openen
pl: Otwórz ustawienia AI
pt_br: Abrir Ajustes de IA
ru: Открыть настройки ИИ
tr: AI Ayarlarını Aç
uk: Відкрити налаштування ШІ
vi: Mở Cài đặt AI
zh_hans: 打开 AI 设置
zh_hant: 開啟 AI 設定

# rag.workspace.error.action.removeAttachments
source: Remove attachments
ar: إزالة المرفقات
de: Anhänge entfernen
es: Eliminar archivos adjuntos
fr: Supprimer les pièces jointes
id: Hapus lampiran
it: Rimuovi allegati
ja: 添付ファイルを削除
ko: 첨부 파일 제거
nl: Bijlagen verwijderen
pl: Usuń załączniki
pt_br: Remover anexos
ru: Удалить вложения
tr: Ekleri kaldır
uk: Видалити вкладення
vi: Xóa tệp đính kèm
zh_hans: 移除附件
zh_hant: 移除附件

# rag.workspace.error.action.retry
source: Retry
ar: إعادة المحاولة
de: Erneut versuchen
es: Reintentar
fr: Réessayer
id: Coba lagi
it: Riprova
ja: 再試行
ko: 재시도
nl: Opnieuw proberen
pl: Spróbuj ponownie
pt_br: Tentar novamente
ru: Повторить
tr: Yeniden Dene
uk: Повторити
vi: Thử lại
zh_hans: 重试
zh_hant: 重試

# rag.workspace.error.attachment.message
source: Remove the attachments or choose a supported, readable file, then ask again. Your question is preserved.
ar: أزل المرفقات أو اختر ملفًا مدعومًا وقابلًا للقراءة، ثم اسأل مرة أخرى. تم الاحتفاظ بسؤالك.
de: Entfernen Sie die Anhänge oder wählen Sie eine unterstützte, lesbare Datei und fragen Sie erneut. Ihre Frage bleibt erhalten.
es: Elimine los archivos adjuntos o elija un archivo compatible y legible, luego vuelva a preguntar. Su pregunta se conserva.
fr: Supprimez les pièces jointes ou choisissez un fichier pris en charge et lisible, puis posez à nouveau la question. Votre question est conservée.
id: Hapus lampiran atau pilih file yang didukung dan dapat dibaca, lalu tanyakan lagi. Pertanyaan Anda tetap tersimpan.
it: Rimuovi gli allegati o scegli un file supportato e leggibile, poi chiedi di nuovo. La tua domanda è conservata.
ja: 添付ファイルを削除するか、サポートされている読み取り可能なファイルを選択してから再度質問してください。質問内容は保持されています。
ko: 첨부 파일을 제거하거나 지원되는 읽기 가능한 파일을 선택한 후 다시 질문하세요. 질문은 유지됩니다.
nl: Verwijder de bijlagen of kies een ondersteund, leesbaar bestand en stel de vraag opnieuw. Je vraag blijft behouden.
pl: Usuń załączniki lub wybierz obsługiwany, czytelny plik, a następnie zapytaj ponownie. Twoje pytanie zostało zachowane.
pt_br: Remova os anexos ou escolha um arquivo compatível e legível e pergunte novamente. Sua pergunta foi preservada.
ru: Удалите вложения или выберите поддерживаемый читаемый файл, затем задайте вопрос снова. Ваш вопрос сохранён.
tr: Ekleri kaldırın veya desteklenen, okunabilir bir dosya seçin, ardından tekrar sorun. Sorunuz korunur.
uk: Видаліть вкладення або виберіть підтримуваний файл, який можна прочитати, і запитайте знову. Ваше запитання збережено.
vi: Xóa các tệp đính kèm hoặc chọn một tệp được hỗ trợ, có thể đọc được, sau đó hỏi lại. Câu hỏi của bạn được giữ nguyên.
zh_hans: 请移除附件或换用可读取的支持文件后再问；原问题已保留。
zh_hant: 請移除附件或換用可讀取的支援檔案後再問；原問題已保留。

# rag.workspace.error.attachment.title
source: Couldn't read an attachment
ar: تعذرت قراءة مرفق
de: Anhang konnte nicht gelesen werden
es: No se pudo leer un archivo adjunto
fr: Impossible de lire une pièce jointe
id: Tidak dapat membaca lampiran
it: Impossibile leggere un allegato
ja: 添付ファイルを読み取れませんでした
ko: 첨부 파일을 읽을 수 없음
nl: Kan een bijlage niet lezen
pl: Nie można odczytać załącznika
pt_br: Não foi possível ler um anexo
ru: Не удалось прочитать вложение
tr: Bir ek okunamadı
uk: Не вдалося прочитати вкладення
vi: Không thể đọc tệp đính kèm
zh_hans: 无法读取附件
zh_hant: 無法讀取附件

# rag.workspace.error.authentication.message
source: The configured credential was not accepted. Update it in AI Settings, then try again.
ar: لم يتم قبول بيانات الاعتماد المُعدّة. حدّثها في إعدادات AI، ثم حاول مرة أخرى.
de: Die konfigurierte Anmeldeinformation wurde nicht akzeptiert. Aktualisieren Sie sie in den KI-Einstellungen und versuchen Sie es erneut.
es: La credencial configurada no fue aceptada. Actualícela en Configuración de IA e intente de nuevo.
fr: L'identifiant configuré n'a pas été accepté. Mettez-le à jour dans les réglages IA, puis réessayez.
id: Kredensial yang dikonfigurasi tidak diterima. Perbarui di Pengaturan AI, lalu coba lagi.
it: La credenziale configurata non è stata accettata. Aggiornala in Impostazioni AI, poi riprova.
ja: 設定された認証情報が受け入れられませんでした。AI 設定で更新してから再試行してください。
ko: 설정된 자격 증명이 승인되지 않았습니다. AI 설정에서 업데이트한 후 다시 시도하세요.
nl: De geconfigureerde inloggegevens zijn niet geaccepteerd. Werk ze bij in AI-instellingen en probeer het opnieuw.
pl: Skonfigurowane poświadczenie nie zostało zaakceptowane. Zaktualizuj je w ustawieniach AI, a następnie spróbuj ponownie.
pt_br: A credencial configurada não foi aceita. Atualize-a nos Ajustes de IA e tente novamente.
ru: Настроенные учётные данные не были приняты. Обновите их в настройках ИИ и повторите попытку.
tr: Yapılandırılan kimlik bilgisi kabul edilmedi. AI Ayarları'nda güncelleyin ve tekrar deneyin.
uk: Налаштовані облікові дані не прийнято. Оновіть їх у налаштуваннях ШІ та повторіть спробу.
vi: Thông tin xác thực đã cấu hình không được chấp nhận. Cập nhật nó trong Cài đặt AI, sau đó thử lại.
zh_hans: 当前凭据未被接受，请在 AI 设置中更新后再试。
zh_hant: 目前憑證未被接受，請在 AI 設定中更新後再試。

# rag.workspace.error.configuration.message
source: Add a valid API key, base URL, and model in AI Settings, then try again.
ar: أضف مفتاح API صالحًا، وعنوان URL أساسي، ونموذجًا في إعدادات AI، ثم حاول مرة أخرى.
de: Fügen Sie in den KI-Einstellungen einen gültigen API-Schlüssel, eine Basis-URL und ein Modell hinzu und versuchen Sie es erneut.
es: Agregue una clave API, URL base y modelo válidos en Configuración de IA, luego intente de nuevo.
fr: Ajoutez une clé API valide, une URL de base et un modèle dans les réglages IA, puis réessayez.
id: Tambahkan kunci API, URL dasar, dan model yang valid di Pengaturan AI, lalu coba lagi.
it: Aggiungi una chiave API valida, un URL di base e un modello in Impostazioni AI, poi riprova.
ja: AI 設定で有効な API キー、ベース URL、モデルを追加してから再試行してください。
ko: AI 설정에서 유효한 API 키, 기본 URL 및 모델을 추가한 후 다시 시도하세요.
nl: Voeg een geldige API-sleutel, basis-URL en model toe in AI-instellingen en probeer het opnieuw.
pl: Dodaj prawidłowy klucz API, podstawowy URL i model w ustawieniach AI, a następnie spróbuj ponownie.
pt_br: Adicione uma chave de API, URL base e modelo válidos nos Ajustes de IA e tente novamente.
ru: Добавьте действующий API-ключ, базовый URL и модель в настройках ИИ, затем повторите попытку.
tr: AI Ayarları'na geçerli bir API anahtarı, temel URL ve model ekleyin, ardından tekrar deneyin.
uk: Додайте дійсний ключ API, базову URL-адресу та модель у налаштуваннях ШІ, потім повторіть спробу.
vi: Thêm khóa API hợp lệ, URL cơ sở và mô hình trong Cài đặt AI, sau đó thử lại.
zh_hans: 请在 AI 设置中检查 API Key、Base URL 和模型后再试。
zh_hant: 請在 AI 設定中檢查 API Key、Base URL 和模型後再試。

# rag.workspace.error.configuration.title
source: Finish AI setup
ar: إنهاء إعداد AI
de: KI-Einrichtung abschließen
es: Complete la configuración de IA
fr: Terminez la configuration IA
id: Selesaikan pengaturan AI
it: Completa la configurazione AI
ja: AI 設定を完了
ko: AI 설정 완료
nl: AI-installatie voltooien
pl: Zakończ konfigurację AI
pt_br: Conclua a configuração de IA
ru: Завершите настройку ИИ
tr: AI kurulumunu tamamlayın
uk: Завершіть налаштування ШІ
vi: Hoàn tất thiết lập AI
zh_hans: 请完成 AI 配置
zh_hant: 請完成 AI 設定

# rag.workspace.error.embeddingConfiguration.message
source: Complete the embedding provider and model configuration in AI Settings, then try again.
ar: أكمل إعدادات موفر التضمين والنموذج في إعدادات AI، ثم حاول مرة أخرى.
de: Schließen Sie die Konfiguration des Embedding-Anbieters und -Modells in den KI-Einstellungen ab und versuchen Sie es erneut.
es: Complete la configuración del proveedor de incrustaciones y del modelo en Configuración de IA, luego intente de nuevo.
fr: Complétez la configuration du fournisseur d'embedding et du modèle dans les réglages IA, puis réessayez.
id: Lengkapi konfigurasi penyedia embedding dan model di Pengaturan AI, lalu coba lagi.
it: Completa la configurazione del provider di embedding e del modello in Impostazioni AI, poi riprova.
ja: AI 設定で埋め込みプロバイダーとモデルの設定を完了してから再試行してください。
ko: AI 설정에서 임베딩 제공자와 모델 구성을 완료한 후 다시 시도하세요.
nl: Voltooi de configuratie van de embeddingprovider en het model in AI-instellingen en probeer het opnieuw.
pl: Uzupełnij konfigurację dostawcy osadzania i modelu w ustawieniach AI, a następnie spróbuj ponownie.
pt_br: Complete a configuração do provedor e modelo de incorporação nos Ajustes de IA e tente novamente.
ru: Завершите настройку провайдера эмбеддингов и модели в настройках ИИ, затем повторите попытку.
tr: AI Ayarları'nda gömme sağlayıcısı ve model yapılandırmasını tamamlayın, ardından tekrar deneyin.
uk: Завершіть налаштування постачальника вбудовувань та моделі в налаштуваннях ШІ, потім повторіть спробу.
vi: Hoàn tất cấu hình nhà cung cấp nhúng và mô hình trong Cài đặt AI, sau đó thử lại.
zh_hans: 请先在 AI 设置中完成向量化服务商和模型配置，然后重试。
zh_hant: 請先在 AI 設定中完成向量化服務商和模型設定，然後重試。

# rag.workspace.error.embeddingConfiguration.title
source: Finish embedding setup
ar: إنهاء إعداد التضمين
de: Embedding-Einrichtung abschließen
es: Complete la configuración de incrustaciones
fr: Terminez la configuration d'embedding
id: Selesaikan pengaturan embedding
it: Completa la configurazione dell'embedding
ja: 埋め込み設定を完了
ko: 임베딩 설정 완료
nl: Embedding-installatie voltooien
pl: Zakończ konfigurację osadzania
pt_br: Conclua a configuração de incorporação
ru: Завершите настройку эмбеддингов
tr: Gömme kurulumunu tamamlayın
uk: Завершіть налаштування вбудовування
vi: Hoàn tất thiết lập nhúng
zh_hans: 请完成向量化配置
zh_hant: 請完成向量化設定

# rag.workspace.error.embeddingRequest.message
source: The configured embedding model could not complete the request. Check the model and provider settings.
ar: تعذر على نموذج التضمين المُعد إكمال الطلب. تحقق من إعدادات النموذج والموفر.
de: Das konfigurierte Embedding-Modell konnte die Anfrage nicht abschließen. Überprüfen Sie die Modell- und Anbietereinstellungen.
es: El modelo de incrustaciones configurado no pudo completar la solicitud. Verifique la configuración del modelo y del proveedor.
fr: Le modèle d'embedding configuré n'a pas pu traiter la demande. Vérifiez les paramètres du modèle et du fournisseur.
id: Model embedding yang dikonfigurasi tidak dapat menyelesaikan permintaan. Periksa pengaturan model dan penyedia.
it: Il modello di embedding configurato non ha potuto completare la richiesta. Controlla le impostazioni del modello e del provider.
ja: 設定された埋め込みモデルがリクエストを完了できませんでした。モデルとプロバイダーの設定を確認してください。
ko: 설정된 임베딩 모델이 요청을 완료할 수 없습니다. 모델 및 제공자 설정을 확인하세요.
nl: Het geconfigureerde embeddingmodel kon het verzoek niet voltooien. Controleer de model- en providerinstellingen.
pl: Skonfigurowany model osadzania nie mógł zrealizować żądania. Sprawdź ustawienia modelu i dostawcy.
pt_br: O modelo de incorporação configurado não pôde concluir a solicitação. Verifique as configurações do modelo e do provedor.
ru: Настроенная модель эмбеддингов не смогла выполнить запрос. Проверьте настройки модели и провайдера.
tr: Yapılandırılan gömme modeli isteği tamamlayamadı. Model ve sağlayıcı ayarlarını kontrol edin.
uk: Налаштована модель вбудовування не змогла виконати запит. Перевірте налаштування моделі та постачальника.
vi: Mô hình nhúng đã cấu hình không thể hoàn thành yêu cầu. Kiểm tra cài đặt mô hình và nhà cung cấp.
zh_hans: 当前向量化模型无法完成请求，请检查模型和服务商配置。
zh_hant: 目前向量化模型無法完成請求，請檢查模型和服務商設定。
